# Напишите программу, которая принимает на вход два числа и проверяет,
# является ли одно число квадратом другого.


# встроенные функции
# переменные
# условия
# циклы
# списки

# num_1 = int(input('Enter num 1: '))
# num_2 = int(input('Enter num 2: '))

# if (num_2 == (num_1 ** 2)) or (print(123)):
#     print(True)
# else:
#     print(False)

# num_1 = int(input('Enter num 1: '))
# num_2 = int(input('Enter num 2: '))

# if (num_2) == (int(num_1) ** 2):
#     print(True)
# else:
#     print(False)
# print(type(num_1))

# Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.

#     Примеры:

#     - 1, 4, 8, 7, 5 -> 8
#     - 78, 55, 36, 90, 2 -> 90

# a = [1, 4, 8, 7, 5]

# max_num = 0
# for b in a:
#     if b > max_num:
#         max_num = b
# print(max_num)

# my_list = [1,4,8,7,5] #list()
# my_list.append(20)
# print(my_list)

# max = list[0]
# i = 1
# while i < 5:
#     if max < list[i]:
#         max = list[i]
#     i += 1
# print(max)
# ==============================
# my_list = []
# for i in range(5):
#     num = int(input('--> '))
#     my_list.append(num)
# print(my_list)
# ==============================
# my_list = [3, 5, 1, 2, 8]
# maxx = my_list[0]
# for item in my_list:
#     if item > maxx:
#         maxx = item
# print(maxx)
# ==============================
# my_list = [3, 5, 1, 2, 8]
# maxx = my_list[0]
# maxx_i = 0
# for i in range(1, len(my_list)):
#     if my_list[i] > maxx:
#         maxx = my_list[i]
#         maxx_i = i

# print(maxx, maxx_i)

# 1. Напишите программу, которая будет на вход принимать число N и выводить числа от -N до N

#     *Примеры:*

#     - 5 -> -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5

# any_number = int(input("Enter a number "))
# for i in range(-any_number, any_number+1):
#     print(i)

# 2. Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.

#     *Примеры:*

#     - 6,78 -> 7
#     - 5 -> нет
#     - 0,34 -> 3

# number = float(input("Input number: "))
# number *= 10
# print(number)
# number = int(number)
# print(number)
# print(number % 10)


# 3. Напишите программу, которая принимает на вход число и проверяет, кратно ли оно (5 и 10) или (15, но не 30)

# any_number = int(input("Enter a number: "))
# if ((any_number % 5 == 0) and (any_number % 10 == 0)) or ((any_number % 15 == 0) and (any_number % 30 != 0)):
#     print('This number works')
# else:
#     print('This number cant be divided by 30')

# HOMEWORK
# встроенные функции +
# переменные +
# условия +
# for +5
# списки +


